Revit 2026 API

# UIDocumentShowElements(ElementSet) Method

---

Shows the elements by zoom to fit.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ShowElements(
	ElementSet elements
)
```
```vb
Public Sub ShowElements (
	elements As ElementSet
)
```
```cpp
public:
void ShowElements(
	ElementSet^ elements
)
```
```fsharp
member ShowElements :
        elements : ElementSet -> unit
```

#### Parameters

elements ElementSet
    The set of elements that will be shown.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Elements is null. |
| ArgumentException | Member of elements is null. |

Places all the elements on the screen by moving the view.

#### Reference

UIDocument Class

ShowElements Overload

Autodesk.Revit.UI Namespace